burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<!-- File naming: <gigadevice>_<GD32F5HC>.svd -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>GD32F5HC</name>
  <version>1.0</version>
  <description>GD32F5HC ARM 32-bit Cortex-M33 Microcontroller based device</description>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>0x20</size>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>DCB</name>
      <description>Debug Control Block</description>
      <groupName>DCB</groupName>
      <baseAddress>0xE000EE08</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DSCSR</name>
          <displayName>DSCSR</displayName>
          <description>Debug Security Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDS</name>
              <description>Current domain Secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	<peripheral>
		<name>ADC</name>
		<description>Analog to digital converter</description>
		<groupName>ADC</groupName>
		<baseAddress>0x40012000</baseAddress>
		<addressBlock>
			<offset>0x0</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
		  <register>
			<name>STAT</name>
			<displayName>STAT</displayName>
			<description>Status register</description>
			<addressOffset>0x00</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IOVF</name>
				  <description>Inserted data register overflow</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ROVF</name>
				  <description>Routine data register overflow</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>STRC</name>
				  <description>Start flag of routine sequence</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>STIC</name>
				  <description>Start flag of inserted sequence</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>EOIC</name>
				  <description>End flag of inserted sequence conversion</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>EORC</name>
				  <description>End flag of routine sequence conversion</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WD0E</name>
				  <description>Analog watchdog 0 event flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CTL0</name>
			<displayName>CTL0</displayName>
			<description>Control register 0</description>
			<addressOffset>0x04</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IOVFIE</name>
				  <description>Interrupt enable for IOVF</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ROVFIE</name>
				  <description>Interrupt enable for ROVF</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RWD0EN</name>
				  <description>Routine sequence analog watchdog 0 enable</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IWD0EN</name>
				  <description>Inserted sequence analog watchdog 0 enable</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DISNUM</name>
				  <description>Number of conversions in discontinuous mode</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DISIC</name>
				  <description>Discontinuous mode on inserted sequence</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DISRC</name>
				  <description>Discontinuous mode on routine sequence</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ICA</name>
				  <description>Inserted sequence convert automatically</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WD0SC</name>
				  <description>When in scan mode, analog watchdog 0 is effective on a single channel</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SM</name>
				  <description>Scan mode</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>EOICIE</name>
				  <description>Interrupt enable for EOIC</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WD0EIE</name>
				  <description>Interrupt enable for WD0E</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>EORCIE</name>
				  <description>Interrupt enable for EORC</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WD0CHSEL</name>
				  <description>Analog watchdog 0 channel select</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CTL1</name>
			<displayName>CTL1</displayName>
			<description>Control register 1</description>
			<addressOffset>0x08</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>SWRCST</name>
				  <description>Software start on routine sequence.</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ETMRC</name>
				  <description>External trigger mode for routine sequence</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ETSRC</name>
				  <description>External trigger select for routine sequence</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SWICST</name>
				  <description>Software start on inserted sequence.</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ETMIC</name>
				  <description>External trigger mode for inserted sequence</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ETSIC</name>
				  <description>External trigger select for inserted sequence</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IDDM</name>
				  <description>DMA disable mode for inserted sequence</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DAL</name>
				  <description>Data alignment</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>EORCM</name>
				  <description>End of routine conversion mode</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RDDM</name>
				  <description>DMA disable mode for routine sequence</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RDMA</name>
				  <description>DMA request enable for routine sequence</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IDMA</name>
				  <description>DMA request enable for inserted sequence</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CTN</name>
				  <description>Continuous mode</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ADCON</name>
				  <description>ADC ON</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>SAMPT0</name>
			<displayName>SAMPT0</displayName>
			<description>Sample time register 0</description>
			<addressOffset>0x0C</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>SPT14</name>
				  <description>Refer to SPT10[2:0] description</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT13</name>
				  <description>Refer to SPT10[2:0] description</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT12</name>
				  <description>Refer to SPT10[2:0] description</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT11</name>
				  <description>Refer to SPT10[2:0] description</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT10</name>
				  <description>Channel sampling time</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>SAMPT1</name>
			<displayName>SAMPT1</displayName>
			<description>Sample time register 1</description>
			<addressOffset>0x10</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>SPT9</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT8</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT7</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT6</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT5</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT4</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT3</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT2</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT1</name>
				  <description>Refer to SPT0[2:0] description</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPT0</name>
				  <description>Channel sampling time</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>IOFF0</name>
			<displayName>IOFF0</displayName>
			<description>Inserted channel data offset register 0</description>
			<addressOffset>0x14</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IOFF</name>
				  <description>Data offset for inserted channel 0.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>IOFF1</name>
			<displayName>IOFF1</displayName>
			<description>Inserted channel data offset register 1</description>
			<addressOffset>0x18</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IOFF</name>
				  <description>Data offset for inserted channel 1.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>IOFF2</name>
			<displayName>IOFF2</displayName>
			<description>Inserted channel data offset register 2</description>
			<addressOffset>0x1c</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IOFF</name>
				  <description>Data offset for inserted channel 2.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>IOFF3</name>
			<displayName>IOFF3</displayName>
			<description>Inserted channel data offset register 3</description>
			<addressOffset>0x20</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IOFF</name>
				  <description>Data offset for inserted channel 3.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>12</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>WD0HT</name>
			<displayName>WD0HT</displayName>
			<description>Watchdog 0 high threshold register</description>
			<addressOffset>0x24</addressOffset>
			<size>0x20</size>
			<resetValue>0x000FFFFF</resetValue>
			<fields>
				<field>
				  <name>WD0HT</name>
				  <description>High threshold for analog watchdog 0</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>20</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>WD0LT</name>
			<displayName>WD0LT</displayName>
			<description>Watchdog 0 low threshold register</description>
			<addressOffset>0x28</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>WD0LT</name>
				  <description>Low threshold for analog watchdog 0</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>20</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>RSQ0</name>
			<displayName>RSQ0</displayName>
			<description>Routine sequence register 0</description>
			<addressOffset>0x2C</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>RL</name>
				  <description>Routine channel length</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>RSQ1</name>
			<displayName>RSQ1</displayName>
			<description>Routine sequence register 1</description>
			<addressOffset>0x30</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>RSQ11</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ10</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ9</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ8</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ7</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ6</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>RSQ2</name>
			<displayName>RSQ2</displayName>
			<description>Routine sequence register 2</description>
			<addressOffset>0x34</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>RSQ5</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ4</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ3</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ2</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ1</name>
				  <description>Refer to RSQ0[4:0] description</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RSQ0</name>
				  <description>The channel number (0..14) is written to these bits to select a channel as the nth conversion in the routine sequence.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>ISQ</name>
			<displayName>ISQ</displayName>
			<description>Inserted sequence register</description>
			<addressOffset>0x38</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IL</name>
				  <description>Inserted channel length.</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ISQ3</name>
				  <description>Refer to ISQ0[4:0] description</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ISQ2</name>
				  <description>Refer to ISQ0[4:0] description</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ISQ1</name>
				  <description>Refer to ISQ0[4:0] description</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ISQ0</name>
				  <description>The channel number (0..14) is written to these bits to select a channel as the nth conversion in the inserted sequence.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>LDATA0</name>
			<displayName>LDATA0</displayName>
			<description>Latch data register 0</description>
			<addressOffset>0x3c</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>LDATAn</name>
				  <description>Inserted or routine number n conversion data.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>LDATA1</name>
			<displayName>LDATA1</displayName>
			<description>Latch data register 1</description>
			<addressOffset>0x40</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>LDATAn</name>
				  <description>Inserted or routine number n conversion data.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
