burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
		  <register>
			<name>LDATA2</name>
			<displayName>LDATA2</displayName>
			<description>Latch data register 2</description>
			<addressOffset>0x44</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>LDATAn</name>
				  <description>Inserted or routine number n conversion data.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>LDATA3</name>
			<displayName>LDATA3</displayName>
			<description>Latch data register 3</description>
			<addressOffset>0x48</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>LDATAn</name>
				  <description>Inserted or routine number n conversion data.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>RDATA</name>
			<displayName>RDATA</displayName>
			<description>Routine data register</description>
			<addressOffset>0x4C</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>RDATA</name>
				  <description>Routine channel data</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>IDATA</name>
			<displayName>IDATA</displayName>
			<description>Inserted data register</description>
			<addressOffset>0x50</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IDATA</name>
				  <description>Inserted channel data</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>LDCTL</name>
			<displayName>LDCTL</displayName>
			<description>Latch data control registe</description>
			<addressOffset>0x54</addressOffset>
			<size>0x20</size>
			<resetValue>0x00010203</resetValue>
			<fields>
				<field>
				  <name>SEQSEL0</name>
				  <description>The ADC_LDATA0 register sequence source selection</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COVSEL0</name>
				  <description>The ADC_LDATA0 register conversion source selection</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SEQSEL1</name>
				  <description>Refer to SEQSEL0 description.</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COVSEL1</name>
				  <description>Refer to COVSEL0[3:0] description.</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SEQSEL2</name>
				  <description>Refer to SEQSEL0 description.</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COVSEL2</name>
				  <description>Refer to COVSEL0[3:0] description.</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SEQSEL3</name>
				  <description>Refer to SEQSEL0 description.</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COVSEL3</name>
				  <description>Refer to COVSEL0[3:0] description.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>OVSAMPCTL</name>
			<displayName>OVSAMPCTL</displayName>
			<description>Oversampling control register</description>
			<addressOffset>0x80</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TOVS</name>
				  <description>Triggered Oversampling</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OVSS</name>
				  <description>Oversampling shift</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OVSR</name>
				  <description>Oversampling ratio</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OVSEN</name>
				  <description>Oversampling enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CCTL</name>
			<displayName>CCTL</displayName>
			<description>Commom control register</description>
			<addressOffset>0x304</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TSVEN</name>
				  <description>Channel 9 (temperature sensor) enable of ADC.</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>INREFEN</name>
				  <description>Channel 10 (internal reference voltage) enable of ADC0.</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>VBATEN</name>
				  <description>Channel 11 (1/4 voltage of external battery) enable of ADC0.</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ADCCK</name>
				  <description>ADC clock</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
