burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
        <register>
          <name>NODEC0</name>
          <displayName>NODEC0</displayName>
          <description>NO OTFDEC region0 register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>NODEC0_EPAGE</name>
              <description>End page of NODEC region 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>NODEC0_SPAGE</name>
              <description>Start page of NODEC region 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NODEC1</name>
          <displayName>NODEC1</displayName>
          <description>NO OTFDEC region1 register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>NODEC1_EPAGE</name>
              <description>End page of NODEC region 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>NODEC1_SPAGE</name>
              <description>Start page of NODEC region 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NODEC2</name>
          <displayName>NODEC2</displayName>
          <description>NO OTFDEC region2 register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>NODEC2_EPAGE</name>
              <description>End page of NODEC region 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>NODEC2_SPAGE</name>
              <description>Start page of NODEC region 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NODEC3</name>
          <displayName>NODEC3</displayName>
          <description>NO OTFDEC region3 register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>NODEC3_EPAGE</name>
              <description>End page of NODEC region 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>NODEC0_SPAGE</name>
              <description>Start page of NODEC region 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFRG</name>
          <displayName>OFRG</displayName>
          <description>Offset region register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00001FFF</resetValue>
          <fields>
            <field>
              <name>OF_EPAGE</name>
              <description>End page of offset region</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>OF_SPAGE</name>
              <description>Start page of offset region</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFVR</name>
          <displayName>OFVR</displayName>
          <description>Offset value register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OF_VALUE</name>
              <description>Offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMPCTL</name>
          <displayName>DMPCTL</displayName>
          <description>DMP control register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMP1_ACC_CFG</name>
              <description>DMP area 1 access configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMP0_ACC_CFG</name>
              <description>DMP area 0 access configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFG</name>
          <displayName>PRIVCFG</displayName>
          <description>Privilege configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMC_PRIV</name>
              <description>FMC privilege configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PID</name>
          <displayName>PID</displayName>
          <description>Product ID register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PID</name>
              <description>Product reserved ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
