burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ICACHE">
      <name>SEC_ICACHE</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x50080000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PKCAU</name>
      <description>Public Key Cryptographic Acceleration Unit</description>
      <groupName>PKCAU</groupName>
      <baseAddress>0x4C061000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PKCAU</name>
        <value>96</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRERRIE</name>
              <description>Address error interrupt enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMERRIE</name>
              <description>RAM error interrupt enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDIE</name>
              <description>End of operation interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODSEL</name>
              <description>PKCAU operation mode selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>PKCAU starts operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKCAUEN</name>
              <description>PKCAU enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRERR</name>
              <description>Address error</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMERR</name>
              <description>PKCAU RAM error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDF</name>
              <description>End of PKCAU operation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATC</name>
          <displayName>STATC</displayName>
          <description>Status clear register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRERRC</name>
              <description>Address error flag clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMERRC</name>
              <description>PKCAU RAM error flag clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDFC</name>
              <description>End of PKCAU operation flag clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PKCAU">
      <name>SEC_PKCAU</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x5C061000</baseAddress>
    </peripheral>
	<peripheral>
		<name>PMU</name>
		<description>Power management unit</description>
		<groupName>PMU</groupName>
		<baseAddress>0x40007000</baseAddress>
		<addressBlock>
			<offset>0x0</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
		  <register>
			<name>CTL0</name>
			<displayName>CTL0</displayName>
			<description>Control register 0</description>
			<addressOffset>0x00</addressOffset>
			<size>0x20</size>
			<resetValue>0x03003000</resetValue>
			<fields>
				<field>
				  <name>DSLPVS</name>
				  <description>Deep-sleep mode voltage select</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDEN</name>
				  <description>Low-driver mode enable in Deep-sleep mode</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDOVS</name>
				  <description>LDO output voltage select</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDNP</name>
				  <description>Low-driver mode when use normal power LDO</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDLP</name>
				  <description>Low-driver mode when use low power LDO.</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>VLVDEN</name>
				  <description>VDDA low voltage detect enable</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>BKPWEN</name>
				  <description>Backup Domain Write Enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LVDT</name>
				  <description>Low Voltage Detector Threshold</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LVDEN</name>
				  <description>Low Voltage Detector Enable</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>STBRST</name>
				  <description>Standby Flag Reset</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WURST</name>
				  <description>Wakeup Flag Reset</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>STBMOD</name>
				  <description>Standby Mode</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDOLP</name>
				  <description>LDO Low Power Mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CS0</name>
			<displayName>CS0</displayName>
			<description>Control and status register 0</description>
			<addressOffset>0x04</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>WUP7_EDGE</name>
				  <description>WKUP Pin7 edge selection</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP6_EDGE</name>
				  <description>WKUP Pin6 edge selection</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP5_EDGE</name>
				  <description>WKUP Pin5 edge selection</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN7</name>
				  <description>WKUP Pin7 (PD3) Enable</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN6</name>
				  <description>WKUP Pin6 (PB0) Enable</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN5</name>
				  <description>WKUP Pin5 (PD4) Enable</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDRF</name>
				  <description>Low-driver mode ready flag</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP4_EDGE</name>
				  <description>WKUP Pin4 edge selection</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LDOVSRF</name>
				  <description>LDO voltage select ready flag</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>WUPEN4</name>
				  <description>WKUP Pin4 (PD5) Enable</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN3</name>
				  <description>WKUP Pin3 (PA12) Enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN2</name>
				  <description>WKUP Pin2 (PB2) Enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN1</name>
				  <description>WKUP Pin1 (PA15) Enable</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUPEN0</name>
				  <description>WKUP Pin0 (PA2) Enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP3_EDGE</name>
				  <description>WKUP Pin3 edge selection</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP2_EDGE</name>
				  <description>WKUP Pin2 edge selection</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP1_EDGE</name>
				  <description>WKUP Pin1 edge selection</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP0_EDGE</name>
				  <description>WKUP Pin0 edge selection</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>VLVDF</name>
				  <description>VDDA Low Voltage Detector Status Flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>LVDF</name>
				  <description>Low Voltage Detector Status Flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>STBF</name>
				  <description>Standby Flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>WUF</name>
				  <description>Wakeup Flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CTL1</name>
			<displayName>CTL1</displayName>
			<description>Control register 1</description>
			<addressOffset>0x08</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000002</resetValue>
			<fields>
				<field>
				  <name>SRAM3PWAKE</name>
				  <description>Setting this bit by software will wakeup SRAM3.</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM3PSLEEP</name>
				  <description>SRAM3 go to sleep when setting this bit by software.</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM2PWAKE</name>
				  <description>Setting this bit by software will wakeup SRAM2.</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM2PSLEEP</name>
				  <description>SRAM2 go to sleep when setting this bit by software.</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM1PWAKE</name>
				  <description>Setting this bit by software will wakeup SRAM1.</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM1PSLEEP</name>
				  <description>SRAM1 go to sleep when setting this bit by software.</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CS1</name>
			<displayName>CS1</displayName>
			<description>Control and status register 1</description>
			<addressOffset>0x0C</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>SRAM3PS_ACTIVE</name>
				  <description>SRAM3 is in active state when this bit is set.</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM3PS_SLEEP</name>
				  <description>SRAM3 is in sleep state when this bit is set.</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM2PS_ACTIVE</name>
				  <description>SRAM2 is in active state when this bit is set.</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM2PS_SLEEP</name>
				  <description>SRAM2 is in sleep state when this bit is set.</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM1PS_ACTIVE</name>
				  <description>SRAM1 is in active state when this bit is set.</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM1PS_SLEEP</name>
				  <description>SRAM1 is in sleep state when this bit is set.</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>SECCFG</name>
			<displayName>SECCFG</displayName>
			<description>Secure configuration register</description>
			<addressOffset>0x30</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>LPSSEC</name>
				  <description>SRAM_sleep mode security</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DBPSEC</name>
				  <description>Backup Domain write access security</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>VDMSEC</name>
				  <description>Voltage detection and monitoring security</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LPMSEC</name>
				  <description>Low-power mode security</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP7SEC</name>
				  <description>WKUP pin 7 security</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP6SEC</name>
				  <description>WKUP pin 6 security</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP5SEC</name>
				  <description>WKUP pin 5 security</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP4SEC</name>
				  <description>WKUP pin 4 security</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP3SEC</name>
				  <description>WKUP pin 3 security</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP2SEC</name>
				  <description>WKUP pin 2 security</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP1SEC</name>
				  <description>WKUP pin 1 security</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUP0SEC</name>
				  <description>WKUP pin 0 security</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>PRICFG</name>
			<displayName>PRICFG</displayName>
			<description>Privilege configuration register</description>
			<addressOffset>0x34</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>PRIV</name>
				  <description>This bit can be read by both privileged and unprivileged access.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>DSLVC_ULKKEY</name>
			<displayName>DSLVC_ULKKEY</displayName>
			<description>Deepsleep voltage configure unlock register</description>
			<addressOffset>0x104</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>KEY</name>
				  <description>The DSLPVS bit field in PMU_CTL0 register.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				  <access>write-only</access>
				</field>
			</fields>
		  </register>
