burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="QSPI">
      <name>SEC_QSPI</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x50025800</baseAddress>
    </peripheral>
	<peripheral>
		<name>RCU</name>
		<description>Reset and clock unit</description>
		<groupName>RCU</groupName>
		<baseAddress>0x40023800</baseAddress>
		<addressBlock>
			<offset>0x0</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
		  <register>
			<name>CTL</name>
			<displayName>CTL</displayName>
			<description>Control register</description>
			<addressOffset>0x00</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000083</resetValue>
			<fields>
				<field>
				  <name>IRC48MSTB</name>
				  <description>IRC48M oscillator stabilization flag</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC48MEN</name>
				  <description>Internal high speed oscillator enable</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLI2SSTB</name>
				  <description>PLLI2S clock stabilization flag</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PLLI2SEN</name>
				  <description>PLLI2S enable</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLSTB</name>
				  <description>PLL clock stabilization flag</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PLLEN</name>
				  <description>PLL enable</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HXTALRR</name>
				  <description>HXTAL ready reset signal</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CKMEN</name>
				  <description>HXTAL clock monitor enable</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HXTALBPS</name>
				  <description>High speed crystal oscillator (HXTAL) clock bypass mode enable</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HXTALSTB</name>
				  <description>High speed crystal oscillator (HXTAL) clock stabilization flag</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>HXTALEN</name>
				  <description>High speed crystal oscillator (HXTAL) enable</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC16MCALIB</name>
				  <description>Internal 16MHz RC oscillator calibration value register</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>8</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC16MADJ</name>
				  <description>Internal 16MHz RC oscillator clock trim adjust value</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RCUPRIP</name>
				  <description>RCU privilege protection</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC16MSTB</name>
				  <description>IRC16M Internal 16MHz RC Oscillator stabilization flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC16MEN</name>
				  <description>Internal 16MHz RC oscillator enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>PLL</name>
			<displayName>PLL</displayName>
			<description>PLL register</description>
			<addressOffset>0x04</addressOffset>
			<size>0x20</size>
			<resetValue>0x00003010</resetValue>
			<fields>
				<field>
				  <name>PLLSEL_1</name>
				  <description>Configure clock source selection together with PLLSEL_0</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLP</name>
				  <description>The PLLP output frequency division factor from PLL VCO clock</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLSEL_0</name>
				  <description>PLL (PLLsys and PLLI2S) clock source selection</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLN</name>
				  <description>The PLL VCO clock multiplication factor</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>9</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLPSC</name>
				  <description>The PLL VCO source clock prescaler</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>6</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CFG0</name>
			<displayName>CFG0</displayName>
			<description>Clock configuration register 0</description>
			<addressOffset>0x08</addressOffset>
			<size>0x20</size>
			<resetValue>0x00009400</resetValue>
			<fields>
				<field>
				  <name>CKOUT1SEL</name>
				  <description>CKOUT1 clock source selection</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CKOUT1DIV</name>
				  <description>The CK_OUT1 divider which the CK_OUT1 frequency can be reduced</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CKOUT0DIV</name>
				  <description>The CK_OUT0 divider which the CK_OUT0 frequency can be reduced</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>MCOSEL</name>
				  <description>CKOUT0/CKOUT1 clock source High-precision clock</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CKOUT0SEL</name>
				  <description>CKOUT0 clock source selection</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RTCDIV</name>
				  <description>RTC clock divider factor</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>APB2PSC</name>
				  <description>APB2 prescaler selection</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>APB1PSC</name>
				  <description>APB1 prescaler selection</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SCSS_2</name>
				  <description>System clock switch status</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SCS_2</name>
				  <description>System clock switch</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>AHBPSC</name>
				  <description>AHB prescaler selection</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SCSS</name>
				  <description>System clock switch status</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SCS</name>
				  <description>System clock switch</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>INT</name>
			<displayName>INT</displayName>
			<description>Clock interrupt register</description>
			<addressOffset>0x0C</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>LXTALCKMIF</name>
				  <description>LXTAL clock stuck interrupt flag</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC48MSTBIC</name>
				  <description>IRC48M stabilization interrupt clear</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>IRC48MSTBIE</name>
				  <description>IRC48M Stabilization interrupt enable</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC48MSTBIF</name>
				  <description>IRC48M stabilization interrupt flag</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>LXTALCKMIC</name>
				  <description>LXTAL clock stuck interrupt clear</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CKMIC</name>
				  <description>HXTAL clock stuck interrupt clear</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>PLLI2SSTBIC</name>
				  <description>PLLI2S stabilization interrupt clear</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>PLLSTBIC</name>
				  <description>PLL stabilization interrupt clear</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>HXTALSTBIC</name>
				  <description>HXTAL stabilization interrupt clear</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>IRC16MSTBIC</name>
				  <description>IRC16M stabilization interrupt clear</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>LXTALSTBIC</name>
				  <description>LXTAL stabilization interrupt clear</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>IRC32KSTBIC</name>
				  <description>IRC32K Stabilization interrupt clear</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>PLLI2SSTBIE</name>
				  <description>PLLI2S Stabilization interrupt enable</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLSTBIE</name>
				  <description>PLL Stabilization interrupt enable</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HXTALSTBIE</name>
				  <description>HXTAL Stabilization interrupt enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC16MSTBIE</name>
				  <description>IRC16M Stabilization interrupt enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALSTBIE</name>
				  <description>LXTAL Stabilization interrupt enable</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC32KSTBIE</name>
				  <description>IRC32K Stabilization interrupt enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CKMIF</name>
				  <description>HXTAL Clock Stuck Interrupt Flag</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PLLI2SSTBIF</name>
				  <description>PLLI2S stabilization interrupt flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PLLSTBIF</name>
				  <description>PLL stabilization interrupt flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>HXTALSTBIF</name>
				  <description>HXTAL stabilization interrupt flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC16MSTBIF</name>
				  <description>IRC16M stabilization interrupt flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>LXTALSTBIF</name>
				  <description>LXTAL stabilization interrupt flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC32KSTBIF</name>
				  <description>IRC32K stabilization interrupt flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB1RST</name>
			<displayName>AHB1RST</displayName>
			<description>AHB1 reset register</description>
			<addressOffset>0x10</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>USBFSRST</name>
				  <description>USBFS reset</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DMA1RST</name>
				  <description>DMA1 reset</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DMA0RST</name>
				  <description>DMA0 reset</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CRCRST</name>
				  <description>CRC reset</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TZCRST</name>
				  <description>GTZC reset</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PDRST</name>
				  <description>GPIO port D reset</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PCRST</name>
				  <description>GPIO port C reset</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PBRST</name>
				  <description>GPIO port B reset</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PARST</name>
				  <description>GPIO port A reset</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB2RST</name>
			<displayName>AHB2RST</displayName>
			<description>AHB2 reset register</description>
			<addressOffset>0x14</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TRNGRST</name>
				  <description>TRNG reset</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HAURST</name>
				  <description>HAU reset</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CAURST</name>
				  <description>CAU reset</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PKCAURST</name>
				  <description>PKCAU reset</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB3RST</name>
			<displayName>AHB3RST</displayName>
			<description>AHB3 reset register</description>
			<addressOffset>0x18</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>QSPIRST</name>
				  <description>QSPI reset</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQPIRST</name>
				  <description>SQPI reset</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB1RST</name>
			<displayName>APB1RST</displayName>
			<description>APB1 reset register</description>
			<addressOffset>0x20</addressOffset>
			<size>0x20</size>
			<resetValue>0x10000000</resetValue>
			<fields>
				<field>
				  <name>PMURST</name>
				  <description>PMU reset</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CTCRST</name>
				  <description>CTC reset</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C1RST</name>
				  <description>I2C1 reset</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C0RST</name>
				  <description>I2C0 reset</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART0RST</name>
				  <description>USART0 reset</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART1RST</name>
				  <description>USART1 reset</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPI1RST</name>
				  <description>SPI1 reset</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WWDGTRST</name>
				  <description>WWDGT reset</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER5RST</name>
				  <description>TIMER5 reset</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER4RST</name>
				  <description>TIMER4 reset</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER3RST</name>
				  <description>TIMER3 reset</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER2RST</name>
				  <description>TIMER2 reset</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER1RST</name>
				  <description>TIMER1 reset</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB2RST</name>
			<displayName>APB2RST</displayName>
			<description>APB2 reset register</description>
			<addressOffset>0x24</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TIMER16RST</name>
				  <description>TIMER16 reset</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER15RST</name>
				  <description>TIMER15 reset</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SYSCFGRST</name>
				  <description>SYSCFG reset</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPI0RST</name>
				  <description>SPI0 reset</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ADCRST</name>
				  <description>ADC reset</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART2RST</name>
				  <description>USART2 reset</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER0RST</name>
				  <description>TIMER0 reset</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
