burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
		  <register>
			<name>AHB1EN</name>
			<displayName>AHB1EN</displayName>
			<description>AHB1 enable register</description>
			<addressOffset>0x30</addressOffset>
			<size>0x20</size>
			<resetValue>0x000F0080</resetValue>
			<fields>
				<field>
				  <name>USBFSEN</name>
				  <description>USBFS clock enable</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DMA1EN</name>
				  <description>DMA1 clock enable</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DMA0EN</name>
				  <description>DMA0 clock enable</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM3EN</name>
				  <description>SRAM3 clock enable</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM2EN</name>
				  <description>SRAM2 clock enable</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM1EN</name>
				  <description>SRAM1 clock enable</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM0EN</name>
				  <description>SRAM0 clock enable</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CRCEN</name>
				  <description>CRC clock enable</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TZCEN</name>
				  <description>GTZC clock enable</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PDEN</name>
				  <description>GPIO port D clock enable</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PCEN</name>
				  <description>GPIO port C clock enable</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PBEN</name>
				  <description>GPIO port B clock enable</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PAEN</name>
				  <description>GPIO port A clock enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB2EN</name>
			<displayName>AHB2EN</displayName>
			<description>AHB2 enable register</description>
			<addressOffset>0x34</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TRNGEN</name>
				  <description>TRNG clock enable</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HAUEN</name>
				  <description>HAU clock enable</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CAUEN</name>
				  <description>CAU clock enable</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PKCAUEN</name>
				  <description>PKCAU clock enable</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB3EN</name>
			<displayName>AHB3EN</displayName>
			<description>AHB3 enable register</description>
			<addressOffset>0x38</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>QSPIEN</name>
				  <description>QSPI clock enable</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQPIEN</name>
				  <description>SQPI clock enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB1EN</name>
			<displayName>APB1EN</displayName>
			<description>APB1 enable register</description>
			<addressOffset>0x40</addressOffset>
			<size>0x20</size>
			<resetValue>0x10000000</resetValue>
			<fields>
				<field>
				  <name>PMUEN</name>
				  <description>PMU clock enable</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CTCEN</name>
				  <description>PMU clock enable</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C1EN</name>
				  <description>I2C1 clock enable</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C0EN</name>
				  <description>I2C0 clock enable</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART0EN</name>
				  <description>USART0 clock enable</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART1EN</name>
				  <description>USART1 clock enable</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPI1EN</name>
				  <description>SPI1 clock enable</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WWDGTEN</name>
				  <description>WWDGT clock enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER5EN</name>
				  <description>TIMER5 clock enable</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER4EN</name>
				  <description>TIMER4 clock enable</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER3EN</name>
				  <description>TIMER3 clock enable</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER2EN</name>
				  <description>TIMER2 clock enable</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER1EN</name>
				  <description>TIMER1 clock enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB2EN</name>
			<displayName>APB2EN</displayName>
			<description>APB2 enable register</description>
			<addressOffset>0x44</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TIMER16EN</name>
				  <description>TIMER16 clock enable</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER15EN</name>
				  <description>TIMER15 clock enable</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SYSCFGEN</name>
				  <description>SYSCFG clock enable</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPI0EN</name>
				  <description>SPI0 clock enable</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ADCEN</name>
				  <description>ADC clock enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART2EN</name>
				  <description>USART2 clock enable</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER0EN</name>
				  <description>TIMER0 clock enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB1SPEN</name>
			<displayName>AHB1SPEN</displayName>
			<description>AHB1 sleep mode enable register</description>
			<addressOffset>0x50</addressOffset>
			<size>0x20</size>
			<resetValue>0x206F909F</resetValue>
			<fields>
				<field>
				  <name>USBFSSPEN</name>
				  <description>USBFS clock enable when sleep mode</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DMA1SPEN</name>
				  <description>DMA1 clock enable when sleep mode</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>DMA0SPEN</name>
				  <description>DMA0 clock enable when sleep mode</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM3SPEN</name>
				  <description>SRAM3 clock enable when sleep mode</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM2SPEN</name>
				  <description>SRAM2 clock enable when sleep mode</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM1SPEN</name>
				  <description>SRAM1 clock enable when sleep mode</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SRAM0SPEN</name>
				  <description>SRAM0 clock enable when sleep mode</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>FMCSPEN</name>
				  <description>FMC clock enable when sleep mode</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CRCSPEN</name>
				  <description>CRC clock enable when sleep mode</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TZPCUSPEN</name>
				  <description>TZPCU clock enable when sleep mode</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PDSPEN</name>
				  <description>GPIO port D clock enable when sleep mode</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PCSPEN</name>
				  <description>GPIO port C clock enable when sleep mode</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PBSPEN</name>
				  <description>GPIO port B clock enable when sleep mode</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PASPEN</name>
				  <description>GPIO port A clock enable when sleep mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB2SPEN</name>
			<displayName>AHB2SPEN</displayName>
			<description>AHB2 sleep mode enable register</description>
			<addressOffset>0x54</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000078</resetValue>
			<fields>
				<field>
				  <name>TRNGSPEN</name>
				  <description>TRNG clock enable when sleep mode</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HAUSPEN</name>
				  <description>HAU clock enable when sleep mode</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CAUSPEN</name>
				  <description>CAU clock enable when sleep mode</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PKCAUSPEN</name>
				  <description>PKCAU clock enable when sleep mode</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB3SPEN</name>
			<displayName>AHB3SPEN</displayName>
			<description>AHB3 sleep mode enable register</description>
			<addressOffset>0x58</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000003</resetValue>
			<fields>
				<field>
				  <name>QSPISPEN</name>
				  <description>QSPI clock enable when sleep mode</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SQPISPEN</name>
				  <description>SQPI clock enable when sleep mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB1SPEN</name>
			<displayName>APB1SPEN</displayName>
			<description>APB1 sleep mode enable register</description>
			<addressOffset>0x60</addressOffset>
			<size>0x20</size>
			<resetValue>0x1866481F</resetValue>
			<fields>
				<field>
				  <name>PMUSPEN</name>
				  <description>PMU clock enable when sleep mode</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CTCSPEN</name>
				  <description>CTC clock enable when sleep mode</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C1SPEN</name>
				  <description>I2C1 clock enable when sleep mode</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C0SPEN</name>
				  <description>I2C0 clock enable when sleep mode</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART0SPEN</name>
				  <description>USART0 clock enable when sleep mode</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART1SPEN</name>
				  <description>USART1 clock enable when sleep mode</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPI1SPEN</name>
				  <description>SPI1 clock enable when sleep mode</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WWDGTSPEN</name>
				  <description>WWDGT clock enable when sleep mode</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER5SPEN</name>
				  <description>TIMER5 clock enable when sleep mode</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER4SPEN</name>
				  <description>TIMER4 clock enable when sleep mode</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER3SPEN</name>
				  <description>TIMER3 clock enable when sleep mode</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER2SPEN</name>
				  <description>TIMER2 clock enable when sleep mode</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER1SPEN</name>
				  <description>TIMER1 clock enable when sleep mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB2SPEN</name>
			<displayName>APB2SPEN</displayName>
			<description>APB2 sleep mode enable register</description>
			<addressOffset>0x64</addressOffset>
			<size>0x20</size>
			<resetValue>0x00065111</resetValue>
			<fields>
				<field>
				  <name>TIMER16SPEN</name>
				  <description>TIMER16 clock enable when sleep mode</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER15SPEN</name>
				  <description>TIMER15 clock enable when sleep mode</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SYSCFGSPEN</name>
				  <description>SYSCFG clock enable when sleep mode</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SPI0SPEN</name>
				  <description>SPI0 clock enable when sleep mode</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ADCSPEN</name>
				  <description>ADC clock enable when sleep mode</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART2SPEN</name>
				  <description>USART2 clock enable when sleep mode</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMER0SPEN</name>
				  <description>TIMER0 clock enable when sleep mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>BDCTL</name>
			<displayName>BDCTL</displayName>
			<description>Backup domain control register</description>
			<addressOffset>0x70</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000018</resetValue>
			<fields>
				<field>
				  <name>LXTALSTRON</name>
				  <description>LXTAL start circuit open off control</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>BKPRST</name>
				  <description>Backup domain reset</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RTCEN</name>
				  <description>RTC clock enable</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RTCSRC</name>
				  <description>RTC clock entry selection</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALRR</name>
				  <description>LXTAL ready reset signal</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALCKMD</name>
				  <description>LXTAL clock failure Detection</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALCKMEN</name>
				  <description>LXTAL clock monitor enable</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALDRI</name>
				  <description>LXTAL drive capability</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALBPS</name>
				  <description>LXTAL bypass mode enable</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALSTB</name>
				  <description>Low speed crystal oscillator stabilization flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>LXTALEN</name>
				  <description>LXTAL enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
