burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
		  <register>
			<name>RSTSCK</name>
			<displayName>RSTSCK</displayName>
			<description>Reset source/clock register</description>
			<addressOffset>0x74</addressOffset>
			<size>0x20</size>
			<resetValue>0x0C000000</resetValue>
			<fields>
				<field>
				  <name>LPRSTF</name>
				  <description>Low-power reset flag</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>WWDGTRSTF</name>
				  <description>Window watchdog timer reset flag</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>FWDGTRSTF</name>
				  <description>Free watchdog timer reset flag</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SWRSTF</name>
				  <description>Software reset flag</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PORRSTF</name>
				  <description>Power reset flag</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>EPRSTF</name>
				  <description>External pin reset flag</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>OBLRSTF</name>
				  <description>Option byte loader reset flag</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>RSTFC</name>
				  <description>Reset flag clear</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC32KSTB</name>
				  <description>IRC32K stabilization flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC32KEN</name>
				  <description>IRC32K enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>PLLSSCTL</name>
			<displayName>PLLSSCTL</displayName>
			<description>PLL clock spread spectrum control register</description>
			<addressOffset>0x80</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>SSCGON</name>
				  <description>PLL spread spectrum modulation enable</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SS_TYPE</name>
				  <description>PLL spread spectrum modulation type select</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>MODSTEP</name>
				  <description>These bits configure PLL spread spectrum modulation profile amplitude and frequency</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>15</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>MODCNT</name>
				  <description>These bits configure PLL spread spectrum modulation profile amplitude and frequency</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>13</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>PLLCFG</name>
			<displayName>PLLCFG</displayName>
			<description>PLL clock configuration register</description>
			<addressOffset>0x84</addressOffset>
			<size>0x20</size>
			<resetValue>0x00041400</resetValue>
			<fields>
				<field>
				  <name>PLLI2SPSC</name>
				  <description>The PLLI2S VCO source clock pre-scale.</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLI2SN</name>
				  <description>The PLLI2S VCO clock multiplication factor</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>7</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLI2SDIV</name>
				  <description>PLLI2S clock divider factor.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>6</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>CFG1</name>
			<displayName>CFG1</displayName>
			<description>Clock configuration register 1</description>
			<addressOffset>0x8C</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>USART0SEL</name>
				  <description>USART0 clock source selection</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USART2SEL</name>
				  <description>USART2 clock source selection</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C0SEL</name>
				  <description>I2C0 clock source selection</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TIMERSEL</name>
				  <description>TIMER clock selection</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2C1SEL</name>
				  <description>I2C1Clock Source Selection</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC16MDIV</name>
				  <description>IRC16M clock divider factor for system clock.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>9</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>ADDCTL</name>
			<displayName>ADDCTL</displayName>
			<description>Additional clock control register</description>
			<addressOffset>0x90</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>PLLDIV_I2S</name>
				  <description>The PLL divider factor for I2S clock</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>6</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>I2SSEL</name>
				  <description>I2S Clock Source Selection</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USBFSDIV</name>
				  <description>USBFS clock divider factor</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>USBFSSEL</name>
				  <description>USBFS clock selection</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>SECP_CFG</name>
			<displayName>SECP_CFG</displayName>
			<description>Secure protection configuration register</description>
			<addressOffset>0xC0</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IRC48MSECP</name>
				  <description>IRC48M security</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>BKPSECP</name>
				  <description>BKP security protection</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>RMVRSTFSECP</name>
				  <description>Remove reset flag security protection</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLI2SSECP</name>
				  <description>PLLI2S configuration and status bits security protection</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PLLSECP</name>
				  <description>Main PLL configuration and status bits security protection</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PRESCSECP</name>
				  <description>AHBx/APBx prescaler configuration bits security protection</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SYSCLKSECP</name>
				  <description>SYSCLK clock selection, clock output on MCO configuration</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LXTALSECP</name>
				  <description>LXTAL clock configuration and status bits security protection</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC32KSECP</name>
				  <description>IRC32K clock configuration and status bits security protection</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HXTALSECP</name>
				  <description>HXTAL clock configuration and status bits security protection</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IRC16MSECP</name>
				  <description>IRC16M clock configuration and status bits security protection</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>SECP_STAT</name>
			<displayName>SECP_STAT</displayName>
			<description>Secure protection status register</description>
			<addressOffset>0XC4</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>IRC48MSECF</name>
				  <description>IRC48M security flag</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>BKPSECPF</name>
				  <description>BKP security protection flag</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>RMVRSTFSECPF</name>
				  <description>Remove reset flag security protection flag</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PLLI2SSECPF</name>
				  <description>PLLI2S configuration and status bits security protection flag</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PLLSECPF</name>
				  <description>Main PLL configuration and status bits security protection flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PRESCSECPF</name>
				  <description>AHBx / APBx prescaler configuration bits security protection flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SYSCLKSECPF</name>
				  <description>SYSCLK clock selection, clock output on MCO configuration</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>LXTALSECPF</name>
				  <description>LXTAL clock configuration and status bits security protection flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC32KSECPF</name>
				  <description>IRC32K clock configuration and status bits security protection flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>HXTALSECPF</name>
				  <description>HXTAL clock configuration and status bits security protection flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>IRC16MSECPF</name>
				  <description>IRC16M clock configuration and status bits security protection flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB1SECP_STAT</name>
			<displayName>AHB1SECP_STAT</displayName>
			<description>AHB1 secure protection status register</description>
			<addressOffset>0xC8</addressOffset>
			<size>0x20</size>
			<resetValue>0x000F809F</resetValue>
			<fields>
				<field>
				  <name>USBFSSECPF</name>
				  <description>USBFS security protection flag</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>DMA1SECPF</name>
				  <description>DMA1 security protection flag</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>DMA0SECPF</name>
				  <description>DMA0 security protection flag</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM3SECPF</name>
				  <description>SRAM3 security protection flag</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM2SECPF</name>
				  <description>SRAM2 security protection flag</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM1SECPF</name>
				  <description>SRAM1 security protection flag</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SRAM0SECPF</name>
				  <description>SRAM0 security protection flag</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>FMCSECPF</name>
				  <description>FMC security protection flag</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>CRCSECPF</name>
				  <description>CRC security protection flag</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TZCSECF</name>
				  <description>TZPCU security flag</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PDSECPF</name>
				  <description>GPIO port D security flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PCSECPF</name>
				  <description>GPIO port C security protection flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PBSECPF</name>
				  <description>GPIO port B security protection flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>PASECPF</name>
				  <description>GPIO port A security protection flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB2SECP_STAT</name>
			<displayName>AHB2SECP_STAT</displayName>
			<description>AHB2 secure protection status register</description>
			<addressOffset>0xCC</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TRNGSECPF</name>
				  <description>TRNG security protection flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>HAUSECPF</name>
				  <description>HAU security protection flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>CAUSECPF</name>
				  <description>CAU security protection flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>PKCAUSECPF</name>
				  <description>PKCAU security protection flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>AHB3SECP_STAT</name>
			<displayName>AHB3SECP_STAT</displayName>
			<description>AHB3 secure protection status register</description>
			<addressOffset>0xD0</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000002</resetValue>
			<fields>
				<field>
				  <name>QSPISECPF</name>
				  <description>QSPI security protection flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SQPISECPF</name>
				  <description>SQPI security protection flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB1SECP_STAT</name>
			<displayName>APB1SECP_STAT</displayName>
			<description>APB1 secure protection status register</description>
			<addressOffset>0xD4</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>PMUSECPF</name>
				  <description>PMU security protection flag</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>CTCSECF</name>
				  <description>CTC security flag</description>
				  <bitOffset>27</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>I2C1SECPF</name>
				  <description>I2C1 security protection flag</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>I2C0SECPF</name>
				  <description>I2C0 security protection flag</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>USART0SECPF</name>
				  <description>USART0 security protection flag</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>USART1SECPF</name>
				  <description>USART1 security protection flag</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SPI1SECPF</name>
				  <description>SPI1 security protection flag</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>WWDGTSECPF</name>
				  <description>WWDGT security protection flag</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER5SECPF</name>
				  <description>TIMER5 security protection flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER4SECPF</name>
				  <description>TIMER4 security protection flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER3SECPF</name>
				  <description>TIMER3 security protection flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER2SECPF</name>
				  <description>TIMER2 security protection flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER1SECPF</name>
				  <description>TIMER1 security protection flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
		  <register>
			<name>APB2SECP_STAT</name>
			<displayName>APB2SECP_STAT</displayName>
			<description>APB2 secure protection status register</description>
			<addressOffset>0xD8</addressOffset>
			<size>0x20</size>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
				  <name>TIMER16SECPF</name>
				  <description>TIMER16 security protection flag</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER15SECPF</name>
				  <description>TIMER15 security protection flag</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SYSCFGSECPF</name>
				  <description>SYSCFG security protection flag</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>SPI0SECPF</name>
				  <description>SPI0 security protection flag</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>ADCSECPF</name>
				  <description>ADC security protection flag</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>USART2SECPF</name>
				  <description>USART2 security protection flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
				<field>
				  <name>TIMER0SECPF</name>
				  <description>TIMER0 security protection flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				</field>
			</fields>
		  </register>
