burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
        <register>
          <name>STAT2</name>
          <displayName>STAT2</displayName>
          <description>TZIAC status register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TZSPCIAF</name>
              <description>TZSPC illegal access event flag bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZIACIAF</name>
              <description>TZIAC illegal access event flag bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM0IAF</name>
              <description>SRAM0 illegal access event flag bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC0_REGIAF</name>
              <description>TZBMPC1 REG illegal access event flag bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1IAF</name>
              <description>SRAM1 illegal access event flag bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC1_REGIAF</name>
              <description>TZBMPC2 REG illegal access event flag bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2IAF</name>
              <description>SRAM2 illegal access event flag bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC2_REGIAF</name>
              <description>TZBMPC2 REG illegal access event flag bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3IAF</name>
              <description>SRAM3 illegal access event flag bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC3_REGIAF</name>
              <description>TZBMPC3 REG illegal access event flag bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFUSEIAF</name>
              <description>EFUSE illegal access event flag bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMIAF</name>
              <description>SQPI PSRAM illegal access event flag bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHIAF</name>
              <description>QSPI FLASH illegal access event flag bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMREGIAF</name>
              <description>SQSPI PSRAMREG illegal access event flag bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHREGIAF</name>
              <description>QSPI FLASHREG illegal access event flag bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S1ADDIAF</name>
              <description>I2S1ADD illegal access event flag bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATC0</name>
          <displayName>STATC0</displayName>
          <description>TZIAC flag clear register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0IAFC</name>
              <description>SPI0 illegal access event flag clear bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0IAFC</name>
              <description>TIMER0 illegal access event flag clear bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBFSIAFC</name>
              <description>USBFS illegal access event flag clear bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1IAFC</name>
              <description>I2C1 illegal access flag clear bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0IAFC</name>
              <description>I2C0 illegal access flag clear bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2IAFC</name>
              <description>USART2 illegal access event flag clear bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1IAFC</name>
              <description>USART1 illegal access event flag clear bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1IAFC</name>
              <description>SPI1 illegal access event flag clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWDGIAFC</name>
              <description>FWDG illegal access event flag clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGIAFC</name>
              <description>WWDG illegal access event flag clear bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5IAFC</name>
              <description>TIMER5 illegal access event flag clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER4IAFC</name>
              <description>TIMER4 illegal access event flag clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3IAFC</name>
              <description>TIMER3 illegal access event flag clear bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2IAFC</name>
              <description>TIMER2 illegal access event flag clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1IAFC</name>
              <description>TIMER1 illegal access event flag clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATC1</name>
          <displayName>STATC1</displayName>
          <description>TZIAC flag clear register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTIIAFC</name>
              <description>EXTI illegal access event flag clear bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCIAFC</name>
              <description>FMC illegal access event flag clear bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHIAFC</name>
              <description>FLASH illegal access event flag clear bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCUIAFC</name>
              <description>RCU illegal access event flag clear bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1IAFC</name>
              <description>DMA1 illegal access event flag clear bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA0IAFC</name>
              <description>DMA0 illegal access event flag clear bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSC_CFGIAFC</name>
              <description>SYS CFG illegal access event flag clear bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMUIAFC</name>
              <description>PMU illegal access event flag clear bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCIAFC</name>
              <description>RTC illegal access event flag clear bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKCAUIAFC</name>
              <description>PKCAU illegal access event flag clear bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNGIAFC</name>
              <description>TRNG illegal access event flag clear bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HAUIAFC</name>
              <description>HAU illegal access event flag clear bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAUIAFC</name>
              <description>CAU illegal access event flag clear bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIAFC</name>
              <description>ADC illegal access event flag clear bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICACHEIAFC</name>
              <description>ICACHE illegal access event flag clear bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCIAFC</name>
              <description>CRC illegal access flag clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER16IAFC</name>
              <description>TIMER16 illegal access event flag clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER15IAFC</name>
              <description>TIMER15 illegal access event flag clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0IAFC</name>
              <description>USART0 illegal access event flag clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATC2</name>
          <displayName>STATC2</displayName>
          <description>TZIAC flag clear register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TZSPCIAFC</name>
              <description>TZSPC illegal access event flag clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZIACIAF</name>
              <description>TZIAC illegal access event flag clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM0IAFC</name>
              <description>SRAM0 illegal access event flag clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC0_REGIAFC</name>
              <description>TZBMPC1 REG illegal access event flag clear bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1IAFC</name>
              <description>SRAM1 illegal access event flag clear bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC1_REGIAFC</name>
              <description>TZBMPC2 REG illegal access event flag clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2IAFC</name>
              <description>SRAM2 illegal access event flag clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC2_REGIAFC</name>
              <description>TZBMPC2 REG illegal access event flag clear bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3IAFC</name>
              <description>SRAM3 illegal access event flag clear bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC3_REGIAFC</name>
              <description>TZBMPC3 REG illegal access event flag clear bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFUSEIAFC</name>
              <description>EFUSE illegal access event flag clear bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMIAFC</name>
              <description>SQPI PSRAM illegal access event flag clear bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHIAFC</name>
              <description>QSPI FLASH illegal access event flag clear bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMREGIAFC</name>
              <description>SQSPI PSRAMREG illegal access event flag clear bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHREGIAFC</name>
              <description>QSPI FLASHREG illegal access event flag clear bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S1ADDIAFC</name>
              <description>I2S1ADD illegal access event flag clear bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
