burakenez/gd32f5hc-cmake-vscode/Projects/GD32F5HCR_EVAL/10_SPI_LCD/GD32F5HC.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TZIAC">
      <name>SEC_TZIAC</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x500A0400</baseAddress>
    </peripheral>
    <peripheral>
      <name>TZSPC</name>
      <description>TrustZone security controller</description>
      <groupName>TZPCU</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>TZSPC control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TZSPC items lock configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_CFG0</name>
          <displayName>SAM_CFG0</displayName>
          <description>TZSPC secure access mode configuration register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0SAM</name>
              <description>SPI0 secure access mode configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0SAM</name>
              <description>TIMER0 secure access mode configuration bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBFSSAM</name>
              <description>USBFS secure access mode configuration bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SAM</name>
              <description>I2C1 secure access mode configuration bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0SAM</name>
              <description>I2C0 secure access mode configuration bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2SAM</name>
              <description>USART2 secure access mode configuration bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1SAM</name>
              <description>USART1 secure access mode configuration bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1SAM</name>
              <description>SPI1 secure access mode configuration bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWDGSAM</name>
              <description>FWDG secure access mode configuration bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGSAM</name>
              <description>WWDG secure access mode configuration bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5SAM</name>
              <description>TIMER5 secure access mode configuration bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER4SAM</name>
              <description>TIMER4 secure access mode configuration bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3SAM</name>
              <description>TIMER3 secure access mode configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2SAM</name>
              <description>TIMER2 secure access mode configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1SAM</name>
              <description>TIMER1 secure access mode configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_CFG1</name>
          <displayName>SAM_CFG1</displayName>
          <description>TZSPC secure access mode configuration register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PKCAUSAM</name>
              <description>PKCAU secure access mode configuration bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNGSAM</name>
              <description>TRNG secure access mode configuration bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HAUSAM</name>
              <description>HAU secure access mode configuration bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAUSAM</name>
              <description>CAU secure access mode configuration bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCSAM</name>
              <description>ADC secure access mode configuration bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICACHESAM</name>
              <description>ICACHE secure access mode configuration bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCSAM</name>
              <description>CRC secure access mode configuration bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER16SAM</name>
              <description>TIMER16 secure access mode configuration bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER15SAM</name>
              <description>TIMER15 secure access mode configuration bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0SAM</name>
              <description>USART0 secure access mode configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRSSEC</name>
              <description>CRS secure access mode configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_CFG2</name>
          <displayName>SAM_CFG2</displayName>
          <description>TZSPC secure access mode configuration register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2S1ADDSAM</name>
              <description>I2S1ADD secure access mode configuration bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHREGSAM</name>
              <description>QSPI flash register secure access mode configuration bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMREGSAM</name>
              <description>SQPI PSRAM register secure access mode configuration bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFUSESAM</name>
              <description>EFUSE register secure access mode configuration bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PAM_CFG0</name>
          <displayName>PAM_CFG0</displayName>
          <description>TZSPC privilege access mode configuration register1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0PAM</name>
              <description>SPI0 privilege access mode configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0PAM</name>
              <description>TIMER0 privilege access mode configuration bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBFSPAM</name>
              <description>USBFS privilege access mode configuration bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1PAM</name>
              <description>I2C1 privilege access mode configuration bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0PAM</name>
              <description>I2C0 privilege access mode configuration bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2PAM</name>
              <description>USART2 privilege access mode configuration bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1PAM</name>
              <description>USART1 privilege access mode configuration bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1PAM</name>
              <description>SPI1 privilege access mode configuration bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWDGPAM</name>
              <description>FWDG privilege access mode configuration bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGPAM</name>
              <description>WWDG privilege access mode configuration bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5PAM</name>
              <description>TIMER5 privilege access mode configuration bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER4PAM</name>
              <description>TIMER4 privilege access mode configuration bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3PAM</name>
              <description>TIMER3 privilege access mode configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2PAM</name>
              <description>TIMER2 privilege access mode configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1PAM</name>
              <description>TIMER1 privilege access mode configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PAM_CFG1</name>
          <displayName>PAM_CFG1</displayName>
          <description>TZSPC privilege access mode configuration register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PKCAUPAM</name>
              <description>PKCAU privilege access mode configuration bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNGPAM</name>
              <description>TRNG privilege access mode configuration bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HAUPAM</name>
              <description>HAU privilege access mode configuration bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAUPAM</name>
              <description>CAU privilege access mode configuration bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCPAM</name>
              <description>ADC privilege access mode configuration bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICACHEPAM</name>
              <description>ICACHE register privilege access mode configuration bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCPAM</name>
              <description>CRC privilege access mode configuration bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER16PAM</name>
              <description>TIMER16 privilege access mode configuration bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER15PAM</name>
              <description>TIMER15 privilege access mode configuration bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0PAM</name>
              <description>USART0 privilege access mode configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRSPRIV</name>
              <description>CRS privilege access mode configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PAM_CFG2</name>
          <displayName>PAM_CFG2</displayName>
          <description>TZSPC privilege access mode configuration register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2S1ADDPAM</name>
              <description>I2S1ADD privilege access mode configuration bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHREGPAM</name>
              <description>QSPI flash register privilege access mode configuration bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMREGPAM</name>
              <description>SQPI PSRAM register privilege access mode configuration bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGPAM</name>
              <description>DBG register privilege access mode configuration bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFUSEPAM</name>
              <description>EFUSE register privilege access mode configuration bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZMMPC0_NSM0</name>
          <displayName>TZMMPC0_NSM0</displayName>
          <description>TZSPC external memory 0 non-secure mark register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>NSM0_LEN</name>
              <description>Length of the first non-secure area</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>NSM0_SADD</name>
              <description>The non-secure area (multiple of 8 Kbytes) start address of TZBPC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZMMPC1_NSM0</name>
          <displayName>TZMMPC1_NSM0</displayName>
          <description>TZSPC external memory 1 non-secure mark register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>NSM0_LEN</name>
              <description>Length of the non-secure area</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>NSM0_SADD</name>
              <description>The non-secure area (multiple of 8 Kbytes) start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZMMPC0_NSM1</name>
          <displayName>TZMMPC0_NSM1</displayName>
          <description>TZSPC external memory 0 non-secure mark register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSM1_LEN</name>
              <description>Length of the first non-secure area</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>NSM1_SADD</name>
              <description>The first non-secure area (multiple of 8 Kbytes) start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZMMPC1_NSM1</name>
          <displayName>TZMMPC1_NSM1</displayName>
          <description>TZSPC external memory 1 non-secure mark register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSM1_LEN</name>
              <description>Length of the non-secure area</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>NSM1_SADD</name>
              <description>The non-secure area (multiple of 8 Kbytes) start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZMPC0_NSM2</name>
          <displayName>TZMPC0_NSM2</displayName>
          <description>TZSPC external memory 0 non-secure mark register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSM2_LEN</name>
              <description>Length of the non-secure area</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>NSM2_SADD</name>
              <description>The non-secure area (multiple of 8 Kbytes) start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
